app/controllers/tasks_controller.rb

        task = Task.new({
          title: params[:title],
          description: params[:description]
        })
        binding.pry
        task.save
---
INSERT INTO "tasks" ("title", "description", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "hello"], ["description", "world"], ["created_at", "2023-12-06 17:36:27.166278"], ["updated_at", "2023-12-06 17:36:27.166278"]]